In [1]:
import numpy as np
import pandas as pd

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))

df

                   A         B         C         D
2013-01-01 -1.851504 -0.135949  0.164203 -0.912107
2013-01-02  0.598874  0.292745 -0.097187 -1.510409
2013-01-03  1.288972  1.007874 -0.085295 -0.260901
2013-01-04  0.291043 -0.061748 -1.324522 -1.548297
2013-01-05 -1.811828  0.142986  0.108857 -1.000770
2013-01-06 -0.379386  0.114921  0.843002 -0.712227

In [6]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)


df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [7]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [8]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 0 to 3
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      float64
 1   B       4 non-null      datetime64[s]
 2   C       4 non-null      float32
 3   D       4 non-null      int32
 4   E       4 non-null      category
 5   F       4 non-null      object
dtypes: category(1), datetime64[s](1), float32(1), float64(1), int32(1), object(1)
memory usage: 288.0+ bytes

In [9]:
df.head()

                   A         B         C         D
2013-01-01 -1.851504 -0.135949  0.164203 -0.912107
2013-01-02  0.598874  0.292745 -0.097187 -1.510409
2013-01-03  1.288972  1.007874 -0.085295 -0.260901
2013-01-04  0.291043 -0.061748 -1.324522 -1.548297
2013-01-05 -1.811828  0.142986  0.108857 -1.000770

In [10]:
df.tail()

                   A         B         C         D
2013-01-02  0.598874  0.292745 -0.097187 -1.510409
2013-01-03  1.288972  1.007874 -0.085295 -0.260901
2013-01-04  0.291043 -0.061748 -1.324522 -1.548297
2013-01-05 -1.811828  0.142986  0.108857 -1.000770
2013-01-06 -0.379386  0.114921  0.843002 -0.712227

In [11]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [12]:
df2.index

Index([0, 1, 2, 3], dtype='int64')

In [13]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [14]:
df

                   A         B         C         D
2013-01-01 -1.851504 -0.135949  0.164203 -0.912107
2013-01-02  0.598874  0.292745 -0.097187 -1.510409
2013-01-03  1.288972  1.007874 -0.085295 -0.260901
2013-01-04  0.291043 -0.061748 -1.324522 -1.548297
2013-01-05 -1.811828  0.142986  0.108857 -1.000770
2013-01-06 -0.379386  0.114921  0.843002 -0.712227

In [15]:
df.to_numpy()

array([[-1.85150368, -0.13594893,  0.16420325, -0.9121065 ],
       [ 0.59887393,  0.29274482, -0.09718658, -1.51040946],
       [ 1.2889716 ,  1.00787437, -0.08529463, -0.26090108],
       [ 0.29104305, -0.06174785, -1.3245217 , -1.54829671],
       [-1.81182839,  0.14298609,  0.10885716, -1.00077023],
       [-0.37938603,  0.11492129,  0.84300199, -0.71222676]])

In [16]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.310638  0.226805 -0.065157 -0.990785
std    1.294647  0.412023  0.706409  0.489376
min   -1.851504 -0.135949 -1.324522 -1.548297
25%   -1.453718 -0.017581 -0.094214 -1.383000
50%   -0.044171  0.128954  0.011781 -0.956438
75%    0.521916  0.255305  0.150367 -0.762197
max    1.288972  1.007874  0.843002 -0.260901

In [17]:
df

                   A         B         C         D
2013-01-01 -1.851504 -0.135949  0.164203 -0.912107
2013-01-02  0.598874  0.292745 -0.097187 -1.510409
2013-01-03  1.288972  1.007874 -0.085295 -0.260901
2013-01-04  0.291043 -0.061748 -1.324522 -1.548297
2013-01-05 -1.811828  0.142986  0.108857 -1.000770
2013-01-06 -0.379386  0.114921  0.843002 -0.712227

In [18]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -1.851504    0.598874    1.288972    0.291043   -1.811828   -0.379386
B   -0.135949    0.292745    1.007874   -0.061748    0.142986    0.114921
C    0.164203   -0.097187   -0.085295   -1.324522    0.108857    0.843002
D   -0.912107   -1.510409   -0.260901   -1.548297   -1.000770   -0.712227

In [19]:
df

                   A         B         C         D
2013-01-01 -1.851504 -0.135949  0.164203 -0.912107
2013-01-02  0.598874  0.292745 -0.097187 -1.510409
2013-01-03  1.288972  1.007874 -0.085295 -0.260901
2013-01-04  0.291043 -0.061748 -1.324522 -1.548297
2013-01-05 -1.811828  0.142986  0.108857 -1.000770
2013-01-06 -0.379386  0.114921  0.843002 -0.712227

In [20]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.912107  0.164203 -0.135949 -1.851504
2013-01-02 -1.510409 -0.097187  0.292745  0.598874
2013-01-03 -0.260901 -0.085295  1.007874  1.288972
2013-01-04 -1.548297 -1.324522 -0.061748  0.291043
2013-01-05 -1.000770  0.108857  0.142986 -1.811828
2013-01-06 -0.712227  0.843002  0.114921 -0.379386

In [21]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-01 -1.851504 -0.135949  0.164203 -0.912107
2013-01-04  0.291043 -0.061748 -1.324522 -1.548297
2013-01-06 -0.379386  0.114921  0.843002 -0.712227
2013-01-05 -1.811828  0.142986  0.108857 -1.000770
2013-01-02  0.598874  0.292745 -0.097187 -1.510409
2013-01-03  1.288972  1.007874 -0.085295 -0.260901

In [22]:
df.sort_values(by="A")

                   A         B         C         D
2013-01-01 -1.851504 -0.135949  0.164203 -0.912107
2013-01-05 -1.811828  0.142986  0.108857 -1.000770
2013-01-06 -0.379386  0.114921  0.843002 -0.712227
2013-01-04  0.291043 -0.061748 -1.324522 -1.548297
2013-01-02  0.598874  0.292745 -0.097187 -1.510409
2013-01-03  1.288972  1.007874 -0.085295 -0.260901

In [25]:
df.sort_values(by=["B","A"])

                   A         B         C         D
2013-01-01 -1.851504 -0.135949  0.164203 -0.912107
2013-01-04  0.291043 -0.061748 -1.324522 -1.548297
2013-01-06 -0.379386  0.114921  0.843002 -0.712227
2013-01-05 -1.811828  0.142986  0.108857 -1.000770
2013-01-02  0.598874  0.292745 -0.097187 -1.510409
2013-01-03  1.288972  1.007874 -0.085295 -0.260901

In [26]:
df['A']

2013-01-01   -1.851504
2013-01-02    0.598874
2013-01-03    1.288972
2013-01-04    0.291043
2013-01-05   -1.811828
2013-01-06   -0.379386
Freq: D, Name: A, dtype: float64

In [27]:
df[['A','B']]

                   A         B
2013-01-01 -1.851504 -0.135949
2013-01-02  0.598874  0.292745
2013-01-03  1.288972  1.007874
2013-01-04  0.291043 -0.061748
2013-01-05 -1.811828  0.142986
2013-01-06 -0.379386  0.114921

In [28]:
df

                   A         B         C         D
2013-01-01 -1.851504 -0.135949  0.164203 -0.912107
2013-01-02  0.598874  0.292745 -0.097187 -1.510409
2013-01-03  1.288972  1.007874 -0.085295 -0.260901
2013-01-04  0.291043 -0.061748 -1.324522 -1.548297
2013-01-05 -1.811828  0.142986  0.108857 -1.000770
2013-01-06 -0.379386  0.114921  0.843002 -0.712227

In [29]:
df[0:3]

                   A         B         C         D
2013-01-01 -1.851504 -0.135949  0.164203 -0.912107
2013-01-02  0.598874  0.292745 -0.097187 -1.510409
2013-01-03  1.288972  1.007874 -0.085295 -0.260901

In [30]:
df.shape

(6, 4)

In [31]:
df.loc[:, ["A", "B"]] # loc

                   A         B
2013-01-01 -1.851504 -0.135949
2013-01-02  0.598874  0.292745
2013-01-03  1.288972  1.007874
2013-01-04  0.291043 -0.061748
2013-01-05 -1.811828  0.142986
2013-01-06 -0.379386  0.114921

In [32]:
df.iloc[0:2,0:3] # index ko loc krna k liya

                   A         B         C
2013-01-01 -1.851504 -0.135949  0.164203
2013-01-02  0.598874  0.292745 -0.097187

In [33]:
df.loc[:,['A','B']]

                   A         B
2013-01-01 -1.851504 -0.135949
2013-01-02  0.598874  0.292745
2013-01-03  1.288972  1.007874
2013-01-04  0.291043 -0.061748
2013-01-05 -1.811828  0.142986
2013-01-06 -0.379386  0.114921

In [34]:
df.iloc[3]

A    0.291043
B   -0.061748
C   -1.324522
D   -1.548297
Name: 2013-01-04 00:00:00, dtype: float64

In [35]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04  0.291043 -0.061748
2013-01-05 -1.811828  0.142986

In [37]:
import seaborn as sns
kashti= sns.load_dataset("titanic")
kashti

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [38]:
kashti.sample(100)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
474,0,3,female,22.0,0,0,9.8375,S,Third,woman,False,NaN,Southampton,no,True
275,1,1,female,63.0,1,0,77.9583,S,First,woman,False,D,Southampton,yes,False
531,0,3,male,NaN,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,no,True
673,1,2,male,31.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,yes,True
753,0,3,male,23.0,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
789,0,1,male,46.0,0,0,79.2000,C,First,man,True,B,Cherbourg,no,True
448,1,3,female,5.0,2,1,19.2583,C,Third,child,False,NaN,Cherbourg,yes,False
504,1,1,female,16.0,0,0,86.5000,S,First,woman,False,B,Southampton,yes,True
571,1,1,female,53.0,2,0,51.4792,S,First,woman,False,C,Southampton,yes,False
754,1,2,female,48.0,1,2,65.0000,S,Second,woman,False,NaN,Southampton,yes,False

In [ ]:
df[df["A"] > 0]

In [39]:
kashti[kashti["age"]<5]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
7,0,3,male,2.00,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
10,1,3,female,4.00,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
16,0,3,male,2.00,4,1,29.1250,Q,Third,child,False,NaN,Queenstown,no,False
43,1,2,female,3.00,1,2,41.5792,C,Second,child,False,NaN,Cherbourg,yes,False
63,0,3,male,4.00,3,2,27.9000,S,Third,child,False,NaN,Southampton,no,False
78,1,2,male,0.83,0,2,29.0000,S,Second,child,False,NaN,Southampton,yes,False
119,0,3,female,2.00,4,2,31.2750,S,Third,child,False,NaN,Southampton,no,False
164,0,3,male,1.00,4,1,39.6875,S,Third,child,False,NaN,Southampton,no,False
171,0,3,male,4.00,4,1,29.1250,Q,Third,child,False,NaN,Queenstown,no,False
172,1,3,female,1.00,1,1,11.1333,S,Third,child,False,NaN,Southampton,yes,False
183,1,2,male,1.00,2,1,39.0000,S,Second,child,False,F,Southampton,yes,False
184,1,3,female,4.00,0,2,22.0250,S,Third,child,False,NaN,Southampton,yes,False
193,1,2,male,3.00,1,1,26.0000,S,Second,child,False,F,Southampton,yes,False
205,0,3,female,2.00,0,1,10.4625,S,Third,child,False,G,Southampton,no,False
261,1,3,male,3.00,4,2,31.3875,S,Third,child,False,NaN,Southampton,yes,False
297,0,1,female,2.00,1,2,151.5500,S,First,child,False,C,Southampton,no,False
305,1,1,male,0.92,1,2,151.5500,S,First,child,False,C,Southampton,yes,False
340,1,2,male,2.00,1,1,26.0000,S,Second,child,False,F,Southampton,yes,False
348,1,3,male,3.00,1,1,15.9000,S,Third,child,False,NaN,Southampton,yes,False
374,0,3,female,3.00,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
381,1,3,female,1.00,0,2,15.7417,C,Third,child,False,NaN,Cherbourg,yes,False
386,0,3,male,1.00,5,2,46.9000,S,Third,child,False,NaN,Southampton,no,False
407,1,2,male,3.00,1,1,18.7500,S,Second,child,False,NaN,Southampton,yes,False
445,1,1,male,4.00,0,2,81.8583,S,First,child,False,A,Southampton,yes,False
469,1,3,female,0.75,2,1,19.2583,C,Third,child,False,NaN,Cherbourg,yes,False
479,1,3,female,2.00,0,1,12.2875,S,Third,child,False,NaN,Southampton,yes,False
530,1,2,female,2.00,1,1,26.0000,S,Second,child,False,NaN,Southampton,yes,False
618,1,2,female,4.00,2,1,39.0000,S,Second,child,False,F,Southampton,yes,False
642,0,3,female,2.00,3,2,27.9000,S,Third,child,False,NaN,Southampton,no,False
644,1,3,female,0.75,2,1,19.2583,C,Third,child,False,NaN,Cherbourg,yes,False
691,1,3,female,4.00,0,1,13.4167,C,Third,child,False,NaN,Cherbourg,yes,False
750,1,2,female,4.00,1,1,23.0000,S,Second,child,False,NaN,Southampton,yes,False
755,1,2,male,0.67,1,1,14.5000,S,Second,child,False,NaN,Southampton,yes,False
788,1,3,male,1.00,1,2,20.5750,S,Third,child,False,NaN,Southampton,yes,False
803,1,3,male,0.42,0,1,8.5167,C,Third,child,False,NaN,Cherbourg,yes,False
824,0,3,male,2.00,4,1,39.6875,S,Third,child,False,NaN,Southampton,no,False
827,1,2,male,1.00,0,2,37.0042,C,Second,child,False,NaN,Cherbourg,yes,False
831,1,2,male,0.83,1,1,18.7500,S,Second,child,False,NaN,Southampton,yes,False
850,0,3,male,4.00,4,2,31.2750,S,Third,child,False,NaN,Southampton,no,False
869,1,3,male,4.00,1,1,11.1333,S,Third,child,False,NaN,Southampton,yes,False

In [40]:
kashti[kashti["age"]<1]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
78,1,2,male,0.83,0,2,29.0000,S,Second,child,False,NaN,Southampton,yes,False
305,1,1,male,0.92,1,2,151.5500,S,First,child,False,C,Southampton,yes,False
469,1,3,female,0.75,2,1,19.2583,C,Third,child,False,NaN,Cherbourg,yes,False
644,1,3,female,0.75,2,1,19.2583,C,Third,child,False,NaN,Cherbourg,yes,False
755,1,2,male,0.67,1,1,14.5000,S,Second,child,False,NaN,Southampton,yes,False
803,1,3,male,0.42,0,1,8.5167,C,Third,child,False,NaN,Cherbourg,yes,False
831,1,2,male,0.83,1,1,18.7500,S,Second,child,False,NaN,Southampton,yes,False

In [41]:
kashti[kashti["age"]<60]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [42]:
kashti[kashti["fare"]<5]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
179,0,3,male,36.0,0,0,0.0000,S,Third,man,True,NaN,Southampton,no,True
263,0,1,male,40.0,0,0,0.0000,S,First,man,True,B,Southampton,no,True
271,1,3,male,25.0,0,0,0.0000,S,Third,man,True,NaN,Southampton,yes,True
277,0,2,male,NaN,0,0,0.0000,S,Second,man,True,NaN,Southampton,no,True
302,0,3,male,19.0,0,0,0.0000,S,Third,man,True,NaN,Southampton,no,True
378,0,3,male,20.0,0,0,4.0125,C,Third,man,True,NaN,Cherbourg,no,True
413,0,2,male,NaN,0,0,0.0000,S,Second,man,True,NaN,Southampton,no,True
466,0,2,male,NaN,0,0,0.0000,S,Second,man,True,NaN,Southampton,no,True
481,0,2,male,NaN,0,0,0.0000,S,Second,man,True,NaN,Southampton,no,True
597,0,3,male,49.0,0,0,0.0000,S,Third,man,True,NaN,Southampton,no,True
633,0,1,male,NaN,0,0,0.0000,S,First,man,True,NaN,Southampton,no,True
674,0,2,male,NaN,0,0,0.0000,S,Second,man,True,NaN,Southampton,no,True
732,0,2,male,NaN,0,0,0.0000,S,Second,man,True,NaN,Southampton,no,True
806,0,1,male,39.0,0,0,0.0000,S,First,man,True,A,Southampton,no,True
815,0,1,male,NaN,0,0,0.0000,S,First,man,True,B,Southampton,no,True
822,0,1,male,38.0,0,0,0.0000,S,First,man,True,NaN,Southampton,no,True

In [43]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)

s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [44]:
df.sub(s, axis="index")

                   A         B         C         D
2013-01-01       NaN       NaN       NaN       NaN
2013-01-02       NaN       NaN       NaN       NaN
2013-01-03  0.288972  0.007874 -1.085295 -1.260901
2013-01-04 -2.708957 -3.061748 -4.324522 -4.548297
2013-01-05 -6.811828 -4.857014 -4.891143 -6.000770
2013-01-06       NaN       NaN       NaN       NaN